Repository: mattiascibien/godot-hub
Catalog: GodotHub/Resources/Strings.*.resx
Languages: es, fr

# InstallCommandDescription
source: Installs a version of Godot
es: Instalar una versión de Godot
fr: Installer une version de Godot

# InstallCommandUnstableOptionDescription
source: Also check for unstable versions
es: Verifique si hay versiones inestables
fr: Vérifier les versions instables

# InstallCommandVersionArgumentDescription
source: The version to install
es: La versión para instalar
fr: La version à installer

# ListCommandDescription
source: Lists installed (and available) Godot
es: Listas instaladas (y disponibles) Godot
fr: Listes installées (et disponibles) Godot

# ListCommandOnlineOptionDescription
source: List also the Godot versions available online
es: Enumere las versiones de Godot disponibles en línea
fr: Lister les versions de Godot disponibles en ligne

# RootCommandDescription
source: Godot installer and version manager
es: Instalador y administrador de versiones de Godot
fr: Installateur Godot et gestionnaire de version

# UnsupportedOSExceptionMessage
source: Unsupported OS
es: SO no compatible
fr: Système d'exploitation non pris en charge

# UnsupportedArchitectureExceptionDefaultMessage
source: Cannot determine architecture
es: No se puede determinar la arquitectura
fr: Impossible de déterminer l'architecture

# UnsupportedArchitectureExceptionMessageWithParameter
source: Cannot determine architecture for package {0}
es: No se puede determinar la arquitectura del paquete {0}
fr: Impossible de déterminer l'architecture du package {0}

# CreateLocalConfigurationCommandDescription
source: Creates a local config for the folder
es: Crea una configuración local para la carpeta
fr: Crée une configuration locale pour le dossier

# LocalConfigurationCommandMigrateOptionDescription
source: Migrates the old .godot-version file
es: Migra el archivo antiguo .godot-version
fr: Migre l'ancien fichier .godot-version

# CreateLocalConfigurationCommandUseVersionOptionDescription
source: Specifies the version to use in our local config
es: Especifica la versión que se utilizará en la configuración local
fr: Spécifie la version à utiliser dans notre configuration locale

# InstallCommandMonoOptionDescription
source: Install a version that has mono
es: Instale una versión que tenga Mono
fr: Installer une version qui a Mono

# InstallCommandHeadlessOptionDescription
source: Install a headless version
es: Instalar una versión "headless"
fr: Installer une version "headless"

# InstallCommandCheckAvailabilityMessage
source: Checking availability of {0} (mono = {1}) (headless = {2})
es: Comprobando la disponibilidad de {0} (mono = {1}) (headless = {2})
fr: Vérification de la disponibilité de {0} (mono = {1}) (headless = {2})

# InstallCommandLatestVersionMessage
source: Latest {0} version is {1}
es: La última {0} versión es {1}
fr: La dernière {0} version est {1}

# InstallCommandVersionNotFoundMessage
source: Version {0} was not found on the repository
es: No se encontró la versión {0} en el repositorio
fr: La version {0} n'a pas été trouvée sur le référentiel

# InstallCommandMonoNotFoundMessage
source: Version {0} does not have a package with mono
es: La versión {0} no tiene paquete con Mono
fr: La version {0} n'a pas de package avec Mono

# InstallCommandPackageNotFoundMessage
source: Cannot find a package for {0}-{1}
es: No se puede encontrar un paquete para {0} - {1}
fr: Impossible de trouver un package pour {0} - {1}

# InstallCommandInstallationCompleteMessage
source: Version {0} (mono = {1}) (headless = {2}) installed
es: Versión {0} (Mono = {1} ) ("headless" = {2}) instalada
fr: Version {0} (Mono = {1} ) ("headless" = {2} ) installée

# InstallCommandDownloadingMessage
source: Downloading
es: Descargando
fr: Téléchargement

# ListCommandInstalledVersionsHeader
source: Installed Godot Versions
es: Versiones Godot instaladas
fr: Versions de Godot installées

# ListCommandExternalVersionFormat
source: - {0} (external)
es: - {0} (externa)
fr: - {0}(externe)

# ListCommandOnlineVersionsHeader
source: Available Godot Versions
es: Versiones Godot disponibles
fr: Versions disponibles de Godot

# ListCommandOnlineVersionFormat
source: - {0} (mono available = {1})
es: - {0} (mono disponible = {1})
fr: - {0} (mono disponible = {1} )

# RegisterCommandDescription
source: register an external godot installation
es: Registrar una instalación externa de Godot
fr: enregistrer une installation godot externe

# RegisterCommandCustomVersionArgumentDescription
source: the custom version identifier to use (i.e. X.Y-dev)
es: El identificador de versión personalizado que se utilizará (es decir, X.Y-dev)
fr: L'identifiant de version personnalisé à utiliser (c'est-à-dire "X.Y-dev")

# RegisterCommandPathArgumentDescription
source: the path to the godot installation
es: El camino a la instalación de Godot
fr: Le chemin vers l'installation de godot

# RegisterCommandCompletedMessage
source: Registered {0} as {1}
es: Registrada {0}de {1}
fr: Enregistré {0}comme {1}

# RunCommandDescription
source: Lanches Godot in the current directory
es: Lanches Godot en el directorio actual
fr: Lanches Godot dans l'annuaire en cours

# RunCommandUseVersionOptionDescription
source: The version to launch
es: La versión para lanzar
fr: La version à lancer

# RunCommandCmdLineArgumentDescription
source: The command line to pass to godot
es: La línea de comando para pasar a Godot
fr: La ligne de commande à passer à Godot

# RunCommandCannotFindVersionMessage
source: Cannot find a version to run. Specify it with -u <version> parameter
es: No se puede encontrar una versión para ejecutar. Especifíquelo con el parámetro -u <version>
fr: Impossible de trouver une version à exécuter. Spécifiez-le avec le paramètre -u <version>

# UninstallCommandDescription
source: Uninstall a specific godot version
es: Desinstalar una versión específica de Godot
fr: Désinstaller une version de Godot spécifique

# UninstallCommandVersionArgumentDescription
source: The version to install
es: La versión para instalar
fr: La version à installer

# UninstallCommandUninstallingMessage
source: Uninstalling {0}
es: Desinstalar {0}
fr: Désinstallation {0}

# UninstallCommandUninstallCompleteMessage
source: Godot {0} uninstalled.
es: Godot {0} desinstalado
fr: Godot {0}désinstallé.

# UnregisterCommandDescription
source: unregisters an external godot installation
es: Anular el registro de una instalación externa de Godot
fr: Désinscrire une installation Godot externe

# UnregisterCommandCustomVersionArgumentDescription
source: the custom version to unregister (i.e. X.Y-dev)
es: La versión personalizada para anular el registro (es decir, X.Y-dev)
fr: La version personnalisée à désinscrire (c'est-à-dire "X.Y-dev")

# UnregisterCommandUnregisterCompleteMessage
source: Unregistered {0}
es: No registrado {0}
fr: Non enregistré {0}

# UnregisterCommandVersionNotExternalMessage
source: Version {0} does not correspond to an external version
es: La versión {0} no corresponde a una versión externa
fr: La version {0} ne correspond pas à une version externe
